'''
Создайте три переменных name, age и is_student и впишите в них любые имя, возраст и True/False соответственно.
Затем распечатайте эти переменные, передав их тремя аргументами в функцию print, либо вызвав print три раза.
Создайте комментарий в любом месте программы и напишите туда дату решения задачи. Это ни на что не повлияет — просто попрактикуемся в написании комментариев.
'''
#27.05.2025
name = 'Anastasia'
age = 19
is_student = True

print(name)
print(age)
print(is_student)